def lambda_handler(event, context):
    # ------------------------------
    # セットの使い方
    # ------------------------------
    my_set = {1, 2, 3, 4, 5} # セットの定義

    print(my_set) # 出力 1, 2, 3, 4, 5

    for value in my_set:
        print(value)

    # ------------------------------
    # 重複した値の定義
    # ------------------------------
    my_set = {1, 1, 3, 5, 4}
    print(my_set)  # 出力: {1, 3, 4, 5}

    # ------------------------------
    # 要素の追加・削除
    # ------------------------------
    my_set = {1, 3, 36, 9, 3, 5} 
    print(my_set) # 出力：{1, 3, 36, 5, 9}
    
    my_set.add(6)  # 新しい要素の追加
    print(my_set)  # 出力: {1, 3, 36, 5, 6, 9}
    
    my_set.remove(9)  # 要素の削除
    print(my_set)  # 出力：{1, 3, 36, 5, 6}

    # ------------------------------
    # インデックによるアクセス（エラー）
    # ------------------------------
    my_set = {1, 2, 3, 4, 5}
    # my_set[0] = 9  # エラーになる